src/cf/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыСвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыБезСпецоценки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ВредныеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_Шахтеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ВнутригородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МежселеннаяТерритория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_СельскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмуществоЕСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_РегиональныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_ФедеральныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС_ВвозимыеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеНалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ВнутригородскойРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС_НСиПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_МинимальныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госпошлина_ГосрегистрацияОрганизаций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыГосударственныхОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыГосударственныхОрганов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыНалоговИПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВидыНалоговИПлатежейВБюджет</Name>
			<Comment>Налоги, взносы и иные платежи в бюджет</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Заполняется для поставляемых данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаИзменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыПлатежейВГосБюджет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = ПолучитьДоступныеЗначения(Параметры.Отбор, Параметры.СтрокаПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ВидыНалоговыхПлатежей() Экспорт
	
	ВидыПлатежей = Новый Массив;
	ВидыПлатежей.Добавить(Налог);
	ВидыПлатежей.Добавить(НалогАкт);
	ВидыПлатежей.Добавить(НалогСам);
	ВидыПлатежей.Добавить(ВзносыСвышеПредела);
	ВидыПлатежей.Добавить(ВзносыБезСпецоценки);
	
	Возврат ВидыПлатежей;
	
КонецФункции

// Формирует список выбора видов налоговых обязательств в зависимости от вида налога
//
// Параметры:
//   НалогСсылка - СправочникСсылка.ВидыНалоговИПлатежейВБюджет
//   Период - Дата
//
// Возвращаемое значение:
//  СписокЗначений - список видов налоговых обязательств (ПеречислениеСсылка.ВидыПлатежейВГосБюджет)
//
Функция СписокВидовНалоговыхОбязательств(НалогСсылка, Знач Период = Неопределено) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НалогСсылка) Тогда
		СвойстваНалога = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НалогСсылка, "ВидНалога, КодБК");
		ВидНалога = СвойстваНалога.ВидНалога;
		ВидГосударственногоОргана = ПлатежиВБюджетПереопределяемый.ВидГосударственногоОргана(СвойстваНалога.КодБК);
	Иначе
		ВидНалога = Перечисления.ВидыНалогов.ПустаяСсылка();
		ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ПустаяСсылка();
	КонецЕсли;
	
	// Налог, Взносы
	НеактуальныеНалоги = ПлатежиВБюджетКлиентСерверПереопределяемый.НеактуальныеНалоги();
	Если ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть Тогда
		СписокВыбора.Добавить(
			Перечисления.ВидыПлатежейВГосБюджет.Налог,
			ПредставлениеВзносаИП(Перечисления.ВидыПлатежейВГосБюджет.Налог));
		СписокВыбора.Добавить(
			Перечисления.ВидыПлатежейВГосБюджет.ВзносыСвышеПредела,
			ПредставлениеВзносаИП(Перечисления.ВидыПлатежейВГосБюджет.ВзносыСвышеПредела));
	ИначеЕсли Период > УчетЗарплаты.ДатаНачалаАдминистрированияСтраховыхВзносовФНС()
			И (ВидНалога = Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ВредныеУсловия
			ИЛИ ВидНалога = Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ТяжелыеУсловия) Тогда
		// Доп.взносы за вредные и тяжелые условия труда различаются для аттестованных и неаттестованных рабочих мест
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог, НСтр("ru = 'Взносы (спецоценка)'"));
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ВзносыБезСпецоценки, НСтр("ru = 'Взносы (спецоценка отсутствует)'"));
	ИначеЕсли (НеактуальныеНалоги[ВидНалога] <> Неопределено И НЕ НеактуальныеНалоги[ВидНалога].Свойство("АктуальныйНалог"))
		ИЛИ ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганПФР
		ИЛИ ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганФСС Тогда
		// Взносы, которые теперь администрируются ФНС, всё равно являются взносами.
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог, НСтр("ru = 'Взносы'"));
	Иначе
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог, НСтр("ru = 'Налог'"));
	КонецЕсли;
	
	// Пени, Проценты, Штраф
	
	Если ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганПФР Тогда
		ПениПроцентыРаздельно = ПлатежиВБюджетКлиентСервер.ДействуетПриказ90н(Период);
	ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганФСС Тогда
		ПениПроцентыРаздельно = ПлатежиВБюджетКлиентСервер.ДействуетПриказ90н(Период)
			И ВидНалога <> Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС;
	Иначе // НалоговыйОрган, Прочее
		ПениПроцентыРаздельно = ПлатежиВБюджетКлиентСервер.ДействуетПриказ126н(Период);
	КонецЕсли;
	
	Если ПениПроцентыРаздельно Тогда
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПениСам, НСтр("ru = 'Пени'"));
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Проценты, НСтр("ru = 'Проценты'"));
	Иначе
		СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПениСам, НСтр("ru = 'Пени / Проценты'"));
	КонецЕсли;
	
	СписокВыбора.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Штраф, НСтр("ru = 'Штраф'"));
	
	Возврат СписокВыбора;
	
КонецФункции

// Возвращает представление налогового обязательства для генерации назначения платежа
//
// Параметры:
//   НалогСсылка - СправочникСсылка.ВидыНалоговИПлатежейВБюджет
//   ВидНалоговогоОбязательства - ПеречислениеСсылка.ВидыПлатежейВГосБюджет
//
// Возвращаемое значение:
//  Строка - представление налогового обязательства
//
Функция ПредставлениеНалоговогоОбязательства(НалогСсылка, ВидНалоговогоОбязательства) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидНалоговогоОбязательства) Тогда
		Возврат "";
	КонецЕсли;
	
	Представление = НСтр("ru = 'Платеж'");
	
	ВидНалога = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НалогСсылка, "ВидНалога");
	ВидГосударственногоОргана = Справочники.ВидыНалоговИПлатежейВБюджет.ВидГосударственногоОргана(НалогСсылка);
	Если ЗначениеЗаполнено(ВидГосударственногоОргана) Тогда
		
		Если ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган Тогда
			Если ПлатежиВБюджетКлиентСерверПереопределяемый.ЭтоВзносыНаПенсионноеСтрахование(ВидНалога) Тогда
				Представление = ПредставлениеОбязательстваПоУплатеВзносовПФР(ВидНалоговогоОбязательства);
			ИначеЕсли ПлатежиВБюджетКлиентСерверПереопределяемый.ЭтоВзносыНаСоциальноеСтрахование(ВидНалога) Тогда
				Представление = ПредставлениеОбязательстваПоУплатеВзносовФСС(ВидНалоговогоОбязательства);
			Иначе
				Представление = ПредставлениеОбязательстваПоУплатеНалогов(ВидНалоговогоОбязательства);
			КонецЕсли;
		ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганПФР Тогда
			Представление = ПредставлениеОбязательстваПоУплатеВзносовПФР(ВидНалоговогоОбязательства);
		ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганФСС Тогда
			Представление = ПредставлениеОбязательстваПоУплатеВзносовФСС(ВидНалоговогоОбязательства);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ЭтоПени(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = ПениАкт
		Или ВидНалоговогоОбязательства = ПениСам;
	
КонецФункции

Функция ЭтоПроценты(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = Проценты;
	
КонецФункции

Функция ЭтоШтраф(ВидНалоговогоОбязательства) Экспорт
	
	Если ТипЗнч(ВидНалоговогоОбязательства) <> ТипЗнч(ПустаяСсылка()) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидНалоговогоОбязательства = Штраф;
	
КонецФункции

Функция ВидПлатежа(ВидНалоговогоОбязательства) Экспорт
	
	ТипЗначения = ТипЗнч(ВидНалоговогоОбязательства);
	
	Если ТипЗнч(ВидНалоговогоОбязательства) = ТипЗнч(ПустаяСсылка()) Тогда
		Возврат ВидНалоговогоОбязательства;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеВзносаИП(ВидПлатежаВГосБюджет) Экспорт
	
	Если ВидПлатежаВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
		Возврат НСтр("ru = 'Взносы, постоянная часть'");
	ИначеЕсли ВидПлатежаВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.ВзносыСвышеПредела Тогда
		Возврат НСтр("ru = 'Взносы с доходов свыше предела'");
	Иначе
		Возврат "";
	КонецЕсли
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеОбязательстваПоУплатеНалогов(ВидНалоговогоОбязательства)
	
	Если ЭтоПени(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Пени по налогу'");
	ИначеЕсли ЭтоПроценты(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Проценты по налогу'");
	ИначеЕсли ЭтоШтраф(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Штраф по налогу'");
	Иначе
		Представление = НСтр("ru = 'Налог'");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеОбязательстваПоУплатеВзносовПФР(ВидНалоговогоОбязательства)
	
	Если ЭтоПени(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Пени по страховым взносам'");
	ИначеЕсли ЭтоПроценты(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Проценты по страховым взносам'");
	ИначеЕсли ЭтоШтраф(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Штраф по страховым взносам'");
	Иначе
		Представление = НСтр("ru = 'Страховые взносы'");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеОбязательстваПоУплатеВзносовФСС(ВидНалоговогоОбязательства)
	
	Если ЭтоПени(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Пени по взносам'");
	ИначеЕсли ЭтоПроценты(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Проценты по взносам'");
	ИначеЕсли ЭтоШтраф(ВидНалоговогоОбязательства) Тогда
		Представление = НСтр("ru = 'Штраф по взносам'");
	Иначе
		Представление = НСтр("ru = 'Взносы'");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПолучитьДоступныеЗначения(Отбор, СтрокаПоиска)
	
	Исключения = Новый Массив;
	
	Если ПлатежиВБюджетКлиентСервер.ДействуетПриказ2017_90н(ДобавитьМесяц(ОбщегоНазначения.ТекущаяДатаПользователя(),-3)) Тогда
		Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию);
		Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПолученоИзФонда);
		Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НеПринято);
	КонецЕсли;
	
	СчетУчета = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	Если Отбор.Свойство("СчетУчета", СчетУчета) Тогда
		Если СчетУчета <> ПланыСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда
			И СчетУчета <> ПланыСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда Тогда
			Исключения.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ВзносыБезСпецоценки);
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеЗначения = Новый СписокЗначений;
	
	Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыПлатежейВГосБюджет.ЗначенияПеречисления Цикл
		
		Если ТипЗнч(СтрокаПоиска) = Тип("Строка")
			И НЕ ПустаяСтрока(СтрокаПоиска)
			И СтрНайти(НРег(ЗначениеПеречисления.Синоним), НРег(СтрокаПоиска)) <> 1 Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Перечисления.ВидыПлатежейВГосБюджет[ЗначениеПеречисления.Имя];
		Если ТипЗнч(Отбор) = Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет")
			И Отбор <> Ссылка Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(Отбор) = Тип("ФиксированныйМассив")
			И Отбор.Найти(Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Исключения.Найти(Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);
		
	КонецЦикла;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
